kaver06/AUTOBOT/AutoBot v1.0/AutoBot v1.0_Workspace/STM32/AutoBot/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_Btn_Pin GPIO_PIN_13
#define USER_Btn_GPIO_Port GPIOC
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define IR_1_Pin GPIO_PIN_0
#define IR_1_GPIO_Port GPIOC
#define LE_CH_A_Pin GPIO_PIN_0
#define LE_CH_A_GPIO_Port GPIOA
#define LE_CH_B_Pin GPIO_PIN_1
#define LE_CH_B_GPIO_Port GPIOA
#define HC05_RX_Pin GPIO_PIN_2
#define HC05_RX_GPIO_Port GPIOA
#define HC05_TX_Pin GPIO_PIN_3
#define HC05_TX_GPIO_Port GPIOA
#define IR_3_Pin GPIO_PIN_4
#define IR_3_GPIO_Port GPIOA
#define Battery_Status_Pin GPIO_PIN_5
#define Battery_Status_GPIO_Port GPIOA
#define IR_4_Pin GPIO_PIN_0
#define IR_4_GPIO_Port GPIOB
#define FR_ECHO_Pin GPIO_PIN_2
#define FR_ECHO_GPIO_Port GPIOB
#define FR_TRIG_Pin GPIO_PIN_10
#define FR_TRIG_GPIO_Port GPIOB
#define LD3_Pin GPIO_PIN_14
#define LD3_GPIO_Port GPIOB
#define STLK_RX_Pin GPIO_PIN_8
#define STLK_RX_GPIO_Port GPIOD
#define STLK_TX_Pin GPIO_PIN_9
#define STLK_TX_GPIO_Port GPIOD
#define RE_CH_A_Pin GPIO_PIN_12
#define RE_CH_A_GPIO_Port GPIOD
#define RE_CH_B_Pin GPIO_PIN_13
#define RE_CH_B_GPIO_Port GPIOD
#define IR_2_Pin GPIO_PIN_2
#define IR_2_GPIO_Port GPIOG
#define USB_PowerSwitchOn_Pin GPIO_PIN_6
#define USB_PowerSwitchOn_GPIO_Port GPIOG
#define USB_OverCurrent_Pin GPIO_PIN_7
#define USB_OverCurrent_GPIO_Port GPIOG
#define FL_TRIG_Pin GPIO_PIN_6
#define FL_TRIG_GPIO_Port GPIOC
#define F_L_ECHO_Pin GPIO_PIN_7
#define F_L_ECHO_GPIO_Port GPIOC
#define USB_SOF_Pin GPIO_PIN_8
#define USB_SOF_GPIO_Port GPIOA
#define ESP_CAM_RX_Pin GPIO_PIN_9
#define ESP_CAM_RX_GPIO_Port GPIOA
#define ESP_CAM_TX_Pin GPIO_PIN_10
#define ESP_CAM_TX_GPIO_Port GPIOA
#define USB_DM_Pin GPIO_PIN_11
#define USB_DM_GPIO_Port GPIOA
#define USB_DP_Pin GPIO_PIN_12
#define USB_DP_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define Buzzer_Pin_Pin GPIO_PIN_11
#define Buzzer_Pin_GPIO_Port GPIOC
#define F_ECHO_Pin GPIO_PIN_3
#define F_ECHO_GPIO_Port GPIOB
#define IMU_SCL_Pin GPIO_PIN_6
#define IMU_SCL_GPIO_Port GPIOB
#define LD2_Pin GPIO_PIN_7
#define LD2_GPIO_Port GPIOB
#define F_TRIG_Pin GPIO_PIN_8
#define F_TRIG_GPIO_Port GPIOB
#define IMU_SDA_Pin GPIO_PIN_9
#define IMU_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
